/*	
 *	re8686_rtl9607c.h
*/
#ifndef _RE8686_RTL9607C_H_
#define _RE8686_RTL9607C_H_
#include <uapi/linux/if.h>
#include <linux/netdevice.h>
#include "../sdk/system/include/common/type.h"


/*================================================
				GMAC used Macros
================================================*/

#define GMAC_SPIN_LOCK_TYPE_BH			1
#define GMAC_SPIN_LOCK_TYPE_IRQSAVE		2
#define GMAC_SPIN_LOCK_TYPE				GMAC_SPIN_LOCK_TYPE_BH

#if (GMAC_SPIN_LOCK_TYPE==GMAC_SPIN_LOCK_TYPE_BH) /* for VoIP test */
#define GMAC_SPIN_LOCK(lock)	spin_lock_bh(lock)
#define GMAC_SPIN_UNLOCK(lock)	spin_unlock_bh(lock)
#else
#define GMAC_SPIN_LOCK(lock)	unsigned long flags;spin_lock_irqsave(lock, flags)
#define GMAC_SPIN_UNLOCK(lock)	spin_unlock_irqrestore(lock, flags)
#endif

	
#if defined(CONFIG_FC_SPECIAL_FAST_FORWARD)	
#define HWNAT_CUSTOMIZE	
#define HWNAT_CUSTOMIZE_NPTV6_SRAM_ACC_V2	
#endif	
#ifndef uint32	
#define uint32 unsigned int	
#endif	
#	
#ifndef SUCCESS	
#define SUCCESS 0	
#endif	
#ifndef FAIL	
#define FAIL -1	
#endif	

#ifdef CONFIG_RX_MRING_INT_SPLIT
#define RX_MRING_INT_SPLIT
#endif

#define TX_RING_DEBUG
#undef TX_RING_DEBUG

#define TX_CREATE_TEST_PACKET_DEBUG
#undef TX_CREATE_TEST_PACKET_DEBUG

#define TX_BURST_PACKET_SEND
//#undef TX_BURST_PACKET_SEND

#ifdef CONFIG_TX_WATCHDOG_TIMEOUT_RESET
#define TX_WATCHDOG_TIMEOUT_RESET
#endif

#ifdef CONFIG_RX_NAPI_MODE
#define RX_NAPI_MODE // otherwise interrupt mode
#endif

#ifdef RX_NAPI_MODE

	IMR1_TOK5		= (1 << 20),
	IMR1_TOK4		= (1 << 19),
	IMR1_TOK3		= (1 << 18),
	IMR1_TOK2		= (1 << 17),
	IMR1_TOK		= (1 << 16)
};

enum RE8670_ISR_REGS{
	RDU6		= (1 << 15),
	RDU5		= (1 << 14),
	RDU4		= (1 << 13),
	RDU3		= (1 << 12),
	RDU2		= (1 << 11),
	SW_INT 		= (1 <<10),
	TDU			= (1 << 9),
	LINK_CHG	= (1 <<	8),
	TER			= (1 << 7),
	TOK			= (1 << 6),
	RDU			= (1 << 5),
	RER_OVF		= (1 << 4),
	RER_RUNT	= (1 << 2),
	RX_OK		= (1 << 0),
	RDU_ALL 	= (RDU | RDU2 | RDU3 | RDU4 | RDU5 | RDU6)
};

#define RX_RDU_CHECK(x) (((x&((u32)RDU2|(u32)RDU3|(u32)RDU4|(u32)RDU5|(u32)RDU6))>>11<<1)|(((x&(u32)RDU)>>5)&1U))

enum RE8670_ISR1_REGS{
	ISR1_TDU5		= (1 << 28),
	ISR1_TDU4		= (1 << 27),
	ISR1_TDU3		= (1 << 26),
	ISR1_TDU2		= (1 << 25),
	ISR1_TDU		= (1 << 24),
	ISR1_TDU_ALL	= (ISR1_TDU|ISR1_TDU2|ISR1_TDU3|ISR1_TDU4|ISR1_TDU5),
	ISR1_TOK5		= (1 << 20),
	ISR1_TOK4		= (1 << 19),
	ISR1_TOK3		= (1 << 18),
	ISR1_TOK2		= (1 << 17),
	ISR1_TOK		= (1 << 16),
	ISR1_TOK_ALL	= (ISR1_TOK|ISR1_TOK2|ISR1_TOK3|ISR1_TOK4|ISR1_TOK5)
};

enum RTL8672GMAC_CPUtag_Control
{
	CTEN_RX     = (1<<31),
	CT_TSIZE	= 27,
	CT_DSLRN	= (1 << 24),
	CT_NORMK	= (1 << 23),
	CT_ASPRI	= (1 << 22),
	CT_APPLO_PRO	= (8 << 18),

	CT_RSIZE_H = 25,
	CT_RSIZE_L = 16,
	CTPM_8306   = (0xf0 << 8),
	CTPM_8368   = (0xe0 << 8),
	CTPM_8370   = (0xff << 8),
	CTPM_8307   = (0xff << 8),
	CTPV_8306   = 0x90,
	CTPV_8368   = 0xa0,
	CTPV_8370   = 0x04,
	CTPV_8307	  = 0x04,
};

enum RTL8672GMAC_CPUtag1_Control
{
	CT1_SID     = (64<<8)

};

enum RTL8672GMAC_PG_REG
{
	EN_PGLBK     = (1<<15),
	DATA_SEL     = (1<<14),
	LEN_SEL      = (1<<11),
	NUM_SEL      = (1<<10),
};

typedef enum
{
	FLAG_WRITE		= (1<<31),
	FLAG_READ		= (0<<31),

	MII_PHY_ADDR_SHIFT	= 26, 
	MII_REG_ADDR_SHIFT	= 16,
	MII_DATA_SHIFT		= 0,
}MIIAR_MASK;

enum RTL8686GMAC_DEBUG_LEVEL{
	RTL8686_PRINT_NOTHING = 0,
	RTL8686_SKB_RX = (1<<0),
	RTL8686_SKB_TX = (1<<1),
	RTL8686_RXINFO = (1<<2),
	RTL8686_TXINFO = (1<<3),
	RTL8686_RX_TRACE = (1<<4),
	RTL8686_TX_TRACE = (1<<5),	
	RTL8686_RX_WARN = (1<<6),	
	RTL8686_TX_WARN = (1<<7),
	RTL8686_OTHERS = (1<<8),
	RTL8686_RX_ALL = (RTL8686_SKB_RX|RTL8686_RXINFO|RTL8686_RX_TRACE),
	RTL8686_TX_ALL = (RTL8686_SKB_TX|RTL8686_TXINFO|RTL8686_TX_TRACE),
};

enum RTL8686_IFFLAG{
	RTL8686_ELAN = 0,
	RTL8686_WAN = 1,
	RTL8686_WLAN = 2,
	RTL8686_SVAP = 3,		// Luke: slave VAP interface, should not be sent by bridge
};	
#ifdef HWNAT_CUSTOMIZE	
enum RTL8686_customize_type{	
	CUSTOMIZE_TYPE_NONE=0,	
	CUSTOMIZE_TYPE_NPTV6_UP=1,	
	CUSTOMIZE_TYPE_NPTV6_DOWN=2,	
	CUSTOMIZE_TYPE_VXLAN_UP=3,	
	CUSTOMIZE_TYPE_VXLAN_DOWN=4,	
	CUSTOMIZE_TYPE_MAX=5,	
};	
#endif

enum RTL8686_MEM_DUMP_FORMAT{
	RTL8686_MEM_DUMP_FORMAT_ADDR = (1<<0),
	RTL8686_MEM_DUMP_FORMAT_HEX = (1<<1),
	RTL8686_MEM_DUMP_FORMAT_TEXT = (1<<2),
	RTL8686_MEM_DUMP_FORMAT_ALL = (RTL8686_MEM_DUMP_FORMAT_ADDR | RTL8686_MEM_DUMP_FORMAT_HEX | RTL8686_MEM_DUMP_FORMAT_TEXT),
};

/*================================================
			GMAC used Structure
================================================*/
struct rx_info{
	union{
		struct{
			u32 own:1;//31
			u32 eor:1;//30
			u32 fs:1;//29
			u32 ls:1;//28
			u32 crcerr:1;//27
			u32 ipv4csf:1;//26
			u32 l4csf:1;//25
			u32 rcdf:1;//24
			u32 ipfrag:1;//23
			u32 pppoetag:1;//22
			u32 rwt:1;//21
			u32 rsvd1:7;//14~17
#ifdef CONFIG_RG_JUMBO_FRAME
			u32 data_length:14;//0~13
#else
			u32 rsvd2:2;//12~13
			u32 data_length:12;//0~11
#endif
		}bit;
		u32 dw;//double word
	}opts1;
	u32 addr;
	union{
		struct{
			u32 cputag:1;//31
			u32 ptp_in_cpu_tag_exist:1;//30
			u32 svlan_tag_exist:1;//29
			u32 reason:8;//21~28
			u32 rsvd_1:4;//17~20
			u32 ctagva:1;//16
			u32 cvlan_tag:16;//0~15
		}bit;
		u32 dw;//double word
	}opts2;
	union{
		struct{
			u32 internal_priority:3;//29~31
			u32 pon_sid_or_extspa:7;//22~28 or 26~28
			u32 l3routing:1;//21
			u32 origformat:1;//20
			u32 src_port_num:4;//16~19
			u32 fbi:1;//15
			u32 fb_hash_or_dst_portmsk:15;//0~14 or 0~6
		}bit;
		struct{
			u32 internal_priority:3;//29~31
			u32 extspa:3;//26~28
			u32 rsvd_1:4;//22~25
			u32 l3routing:1;//21
			u32 origformat:1;//20
			u32 src_port_num:4;//16~19
			u32 fbi:1;//15
			u32 fb_hash_or_dst_portmsk:15;//0~14 or 0~6
		}bit1;
		u32 dw;//double word
	}opts3;
};

struct tx_info{
	union{
		struct{
			u32 own:1;//31
			u32 eor:1;//30
			u32 fs:1;//29
			u32 ls:1;//28
			u32 ipcs:1;//27
			u32 l4cs:1;//26
			u32 tpid_sel:1;//25
			u32 stag_aware:1;//24		
			u32 crc:1;//23
			u32 rsvd:6;//17~22
			u32 data_length:17;//0~16
		}bit;
		u32 dw;//double word
	}opts1;
	u32 addr;
	union{
		struct{
			u32 cputag:1;//31
			u32 tx_svlan_action:2;//29~30
			u32 tx_cvlan_action:2;//27~28
			u32 tx_portmask:11;//16~26
			u32 cvlan_vidl:8;//8~15
			u32 cvlan_prio:3;//5~7
			u32 cvlan_cfi:1;// 4
			u32 cvlan_vidh:4;//0~3
		}bit;
		u32 dw;//double word
	}opts2;
	union{
		struct{
			u32 rsvd1:4;//28~31
			u32 aspri:1;//27
			u32 cputag_pri:3;//24~26
			u32 keep:1;//23
			u32 rsvd2:1;//22
			u32 dislrn:1;//21
			u32 cputag_psel:1;//20
        	u32 gmac_id:2;//18~19  //software used for gmac_tx_idx(0:gmac9, 1:gmac10, 2:gmac7)
			u32 l34_keep:1;//17
			u32 rsvd3:1;//16
			u32 extspa:3;//13~15
			u32 tx_pppoe_action:2;//11~12
			u32 tx_pppoe_idx:4;//7~10
			u32 tx_dst_stream_id:7;//0~6
		}bit;
		u32 dw;//double word
	}opts3;
	union{
		struct{
			u32 lgsen:1;//31
			u32 lgmtu:11;//20~30
			u32 rsvd:4;//16~19
			u32 svlan_vidl:8;//8~15
			u32 svlan_prio:3;//5~7
			u32 svlan_cfi:1;// 4
			u32 svlan_vidh:4;//0~3
		}bit;
		u32 dw;//double word
	}opts4;	
#define tx_fs					opts1.bit.fs	
#define tx_ls					opts1.bit.ls	
#define tx_ipcs					opts1.bit.ipcs	
#define tx_l4cs					opts1.bit.l4cs	
#define tx_tpid_sel				opts1.bit.tpid_sel	
#define tx_stag_aware			opts1.bit.stag_aware	
#define tx_data_length			opts1.bit.data_length	
#define tx_cputag				opts2.bit.cputag	
#define tx_tx_svlan_action		opts2.bit.tx_svlan_action	
#define tx_tx_cvlan_action		opts2.bit.tx_cvlan_action	
#define tx_tx_portmask			opts2.bit.tx_portmask	
#define tx_cvlan_vidl			opts2.bit.cvlan_vidl	
#define tx_cvlan_prio			opts2.bit.cvlan_prio	
#define tx_cvlan_cfi			opts2.bit.cvlan_cfi	
#define tx_cvlan_vidh			opts2.bit.cvlan_vidh	
#define tx_aspri				opts3.bit.aspri	
#define tx_cputag_pri			opts3.bit.cputag_pri	
#define tx_keep					opts3.bit.keep	
