/*
 * Copyright (C) 2012 Realtek Semiconductor Corp.
 * All Rights Reserved.
 *
 * This program is the proprietary software of Realtek Semiconductor
 * Corporation and/or its licensors, and only be used, duplicated,
 * modified or distributed under the authorized license from Realtek.
 *
 * ANY USE OF THE SOFTWARE OTHER THAN AS AUTHORIZED UNDER
 * THIS LICENSE OR COPYRIGHT LAW IS PROHIBITED.
*/

#ifndef __RTK_FC_STRUCT__
#define __RTK_FC_STRUCT__

#if defined(FC_VER_CONTROL)
#include "rtk_fc_ver.h"
#else
#define FC_GIT_VERSION 		"dev.0.0"
#define FC_GIT_SHA1 		"00000000"
#define FC_GIT_SHA1_DATE 	"0000-00-00-0000"
#define FC_GIT_AUTHOR 		"NA"
#define FC_COMPILE_BY 		"NA"
#define FC_COMPILE_DATE 	"0000-00-00-0000"
#endif

#define FC_INTERNAL_VERSION	3

#include <uapi/linux/if_ether.h>
#include <net/netfilter/nf_conntrack.h>
#include <net/gre.h>

#include <linux/workqueue.h> //for wq
#include "rtk_fc_mapper_api.h"		// rt mapper
#include "rtk_fc_api.h"				// fc external api
#include "rtk_fc_define.h"
#include "rtk_fc_error.h"
#include "rtk_fc_mgr.h"
#include "rtk_fc_mgrTRx.h"
#include <rt_ext_mapper.h>
#include <uapi/linux/icmp.h>
#include <linux/proc_fs.h>

#if defined(CONFIG_RTK_FC_IPSEC_FASTFWD)
#include <net/xfrm.h>
#include <crypto/aead.h>
#include <crypto/internal/geniv.h>
#endif


#if defined(CONFIG_RTK_L34_G3_PLATFORM)
#if defined(CONFIG_FC_RTL8277C_SERIES)
#include <rtk_8277c_asicDriver.h>
#elif defined(CONFIG_FC_RTL9607F_SERIES)
#include <rtk_9607f_asicDriver.h>
#else

#include <rtk_rg_asic_tblSize.h>
#include "ca_ni.h"
#include <module/intr_bcaster/intr_bcaster.h>
#include <special_packet.h>	//<<FC ACL>> for ca_pkt_type_t, ca_special_packet_set
#endif
#include <rtk_fc_asic_common.h>

#ifdef CONFIG_RTK_L34_XPON_PLATFORM

#if defined(CONFIG_RTL9607C_SERIES)
#include "rtk_rg_apolloPro_asicDriver.h"
#elif defined(CONFIG_RTL9603CVD_SERIES)
#include "rtk_rg_rtl9603cvd_asicDriver.h"
#endif

#if defined(CONFIG_RTL9607C_SERIES)
#include <dal/rtl9607c/dal_rtl9607c.h>
#include <dal/rtl9607c/dal_rtl9607c_hwmisc.h>
#endif
#if defined(CONFIG_RTL9603CVD_SERIES)
#include <dal/rtl9603cvd/dal_rtl9603cvd.h>
#include <dal/rtl9603cvd/dal_rtl9603cvd_hwmisc.h>
#endif

#include <rtk_rg_apolloPro_internal.h>
#include "re8686_nic.h"

// included for link change handler
#include <module/intr_bcaster/intr_bcaster.h>

#include <rtk/acl.h>					//<<FC ACL>> for rtk acl

extern rtk_rg_fbDatabase_t rgpro_db;	// to access apollopro asic related api

#endif

#if defined(CONFIG_RTK_L34_XPON_PLATFORM) || defined(CONFIG_RTK_L34_G3_PLATFORM)

typedef enum rtk_fc_cputagpppoe_action_e
{
    RTK_FC_CPUTAG_PPPOEACT_KEEP = 0,	// tagif=1: keep; tagif=0: keep
    RTK_FC_CPUTAG_PPPOEACT_ADD, 		// tagif=1: keep; tagif=0: add
    RTK_FC_CPUTAG_PPPOEACT_REMOVE,	// tagif=1: remove; tagif=0: keep
    RTK_FC_CPUTAG_PPPOEACT_MODIFY,	// tagif=1: modify; tagif=0: add
    RTK_FC_CPUTAG_PPPOEACT_END
}rtk_fc_cputagpppoe_action_t;

#endif //CONFIG_RTK_L34_XPON_PLATFORM

typedef enum rtk_fc_wifi_lut_fid_e
{
	RTK_FC_WIFI_FID_0 = 0,		// gmac 0
	RTK_FC_WIFI_FID_1 = 1,		// gmac 1
	RTK_FC_WIFI_FID_2 = 2,		// gmac 2
	RTK_FC_WIFI_FID_END = 3,
}rtk_fc_wifi_lut_fid_t;

typedef enum rtk_fc_packetType_e
{
	RTK_FC_PKTTYPE_UC,
	RTK_FC_PKTTYPE_MC,
	RTK_FC_PKTTYPE_BC,
}rtk_fc_packetType_t;

typedef enum rtk_fc_hostMibType_e
{
	RX_BYTE_CNT,
	TX_BYTE_CNT,
}rtk_fc_hostMibType_t;

typedef enum rtk_fc_flowMibType_e
{
	IN_PKT_CNT,
	IN_BYTE_CNT,
	OUT_PKT_CNT,
	OUT_BYTE_CNT,
}rtk_fc_flowMibType_t;

typedef enum rtk_fc_netifMibType_e
{
	IN_UC_PKT_CNT,
	IN_UC_BYTE_CNT,
	IN_MC_PKT_CNT,
	IN_MC_BYTE_CNT,
	IN_BC_PKT_CNT,
	IN_BC_BYTE_CNT,
	OUT_UC_PKT_CNT,
	OUT_UC_BYTE_CNT,
	OUT_MC_PKT_CNT,
	OUT_MC_BYTE_CNT,
	OUT_BC_PKT_CNT,
	OUT_BC_BYTE_CNT,
}rtk_fc_netifMibType_t;

typedef enum rtk_fc_enum_pppCompressMode_e
{
	RTK_FC_COMP_PPP_FF0300XX=4,
	RTK_FC_COMP_PPP_FF03XX=3,
	RTK_FC_COMP_PPP_00XX=2,
	RTK_FC_COMP_PPP_XX=1,
	RTK_FC_COMP_PPP_END=0,
}rtk_fc_enum_pppCompressMode_t;

/* NIC ==================================================================== */
#if defined(CONFIG_LUNA_G3_SERIES)


#define SKB_BUF_SIZE  1800


typedef enum {
	RE8686_RXPRI_DEFAULT=0,
	RE8686_RXPRI_RG,
	RE8686_RXPRI_L34LITE,
	RE8686_RXPRI_VOIP,
	RE8686_RXPRI_OMCI,
	RE8686_RXPRI_OAM,
	RE8686_RXPRI_MPCP,
	RE8686_RXPRI_MUTICAST,
	RE8686_RXPRI_DUMP,
	RE8686_RXPRI_PATCH,	
	RE8686_RXPRI_NPTV6_FF,
	RE8686_RXPRI_WIFI,
}RE8686_RX_PRI_T;
#if 0 // refer ca_ext.h
enum {
	RE8670_RX_STOP=0,
	RE8670_RX_CONTINUE,
	RE8670_RX_STOP_SKBNOFREE,
	RE8670_RX_END
};
#endif
// fake rx_info

struct tx_info{
	union{
		struct{
			u32 own:1;//31
			u32 eor:1;//30
			u32 fs:1;//29
			u32 ls:1;//28
			u32 ipcs:1;//27
			u32 l4cs:1;//26
			u32 tpid_sel:1;//25
			u32 stag_aware:1;//24
			u32 crc:1;//23
			u32 rsvd:6;//17~22
			u32 data_length:17;//0~16
		}bit;
		u32 dw;//double word
	}opts1;
	u32 addr;
	union{
		struct{
			u32 cputag:1;//31
			u32 tx_svlan_action:2;//29~30
			u32 tx_cvlan_action:2;//27~28
			u32 tx_portmask:11;//16~26
			u32 cvlan_vidl:8;//8~15
			u32 cvlan_prio:3;//5~7
			u32 cvlan_cfi:1;// 4
			u32 cvlan_vidh:4;//0~3
		}bit;
		u32 dw;//double word
	}opts2;
	union{
		struct{
			u32 extspa:4;//13~15	=> 28~31 for G3
			u32 aspri:1;//27
			u32 cputag_pri:3;//24~26
			u32 keep:1;//23
			u32 rsvd2:1;//22
			u32 dislrn:1;//21
			u32 cputag_psel:1;//20
			u32 rsvd1:2;//18~19
			u32 l34_keep:1;//17
			u32 gmac_id:4;//13~16		 //software used for gmac_tx_idx(0:gmac9, 1:gmac10, 2:gmac7)
			u32 tx_pppoe_action:2;//11~12
			u32 tx_pppoe_idx:4;//7~10
			u32 tx_dst_stream_id:7;//0~6
		}bit;
		u32 dw;//double word
	}opts3;
	union{
		struct{
			u32 lgsen:1;//31
			u32 lgmtu:11;//20~30
			u32 rsvd:4;//16~19
			u32 svlan_vidl:8;//8~15
			u32 svlan_prio:3;//5~7
			u32 svlan_cfi:1;// 4
			u32 svlan_vidh:4;//0~3
		}bit;
		u32 dw;//double word
	}opts4;
#if defined(CONFIG_FC_RTL8198F_SERIES)
	union{
		struct{
			u32 pe_portmask:23; //9~31
			u32 reserved:9; //0~8
		}bit;
		u32 dw;//double word
	}opts5;
#endif
};

#endif


/* End of NIC ============================================================= */


typedef enum rtk_fc_enum_macType_e
{
    RG_FC_MACTYPE_SA = 0,
    RG_FC_MACTYPE_DA,
} rtk_fc_enum_macType_t;


// Link Status

typedef enum rtk_fc_port_speed_e
{
    RTK_RG_PORT_SPEED_10M = 0,
    RTK_RG_PORT_SPEED_100M,
    RTK_RG_PORT_SPEED_1000M,
    RTK_RG_PORT_SPEED_END,
} rtk_fc_port_speed_t;
typedef enum rtk_fc_port_duplex_e
{
    RTK_RG_PORT_HALF_DUPLEX = 0,
    RTK_RG_PORT_FULL_DUPLEX,
    RTK_RG_PORT_DUPLEX_END
} rtk_fc_port_duplex_t;
typedef enum rtk_fc_port_linkStatus_e
{
    RTK_RG_PORT_LINKDOWN = 0,
